app/controllers/guys_controller.rb

SELECT "guys".* FROM "guys"
---
  def index
    @guys = Guy.all

INSERT INTO "guys" ("name", "person", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Alex"], ["person", "f"], ["created_at", "2015-09-25 19:20:32.317433"], ["updated_at", "2015-09-25 19:20:32.317433"]]
---
  def create
    @guy = Guy.new(guy_params)

    respond_to do |format|
      if @guy.save

SELECT  "guys".* FROM "guys" WHERE "guys"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_guy
      @guy = Guy.find(params[:id])